zoo_animals_backend/app/controllers/zoos_controller.rb

SELECT "zoos".* FROM "zoos"
---
  def index
    zoos = Zoo.all

SELECT "zoos".* FROM "zoos" WHERE "zoos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    zoo = Zoo.find(params[:id])

INSERT INTO "zoos" ("name", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Zoo Miami"], ["city", "Miami"], ["state", "Florida"], ["created_at", "2020-09-11 18:41:34.761765"], ["updated_at", "2020-09-11 18:41:34.761765"]]
---
  def create
    zoo = Zoo.create(zoo_params)